interfaces/src/main/resources/templates/GeefDossierHandicap/03.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://magda.vlaanderen.be/soczek/soap/geefdossierhandicap/v03_00">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefDossierHandicap>
            <Verzoek>
                <Context>
                    <Naam>GeefDossierHandicap</Naam>
                    <Versie>03.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                            <Criteria>
                                <ConsultFilesByDateCriteria>
                                    <ssin>90010100123</ssin>
                                    <handicapAuthenticSources></handicapAuthenticSources>
                                    <referenceDate>2025-01-01</referenceDate>
                                    <parts></parts>
                                    <decisionStatus>false</decisionStatus>
                                    <enrichedRecognition>false</enrichedRecognition>
                                </ConsultFilesByDateCriteria>
                                <!--<ConsultFilesByPeriodCriteria></ConsultFilesByPeriodCriteria>-->
                            </Criteria>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefDossierHandicap>
    </soapenv:Body>
</soapenv:Envelope>